var map = L.map('map').setView([41.70100428001451, 44.79601098487503], 7);

L.tileLayer('https://tile.openstreetmap.org/{z}/{x}/{y}.png', {
    attribution: '&copy; <a href="https://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors'
}).addTo(map);

L.marker([-33.85663284146483, 151.2152644897121]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/sydney.webp">
    <span style="font-weight: bold;">სიდნეის ოპერის თეატრი</span>
    <span>სიდნეის ოპერის თეატრი არის მსოფლიოს ერთ-ერთი ყველაზე ცნობილი და გამორჩეული არქიტექტურული ნაგებობა, რომელიც მდებარეობს სიდნეიშიში, ავსტრალიაში. მისი დიზაინი ეკუთვნის დანიელ არქიტექტორს იორნ უტზონს, რომელმაც 1957 წელს გაიმარჯვა საერთაშორისო კონკურსში. პროექტი თავიდანვე გამოირჩეოდა თავისი არატრადიციული ფორმით — შენობის სახურავები გავს ზღვის ნიჟარებს ან იალქნებს, რაც მას უნიკალურ ვიზუალურ იერს აძლევს.
<br><br>მშენებლობა დაიწყო 1959 წელს, თუმცა პროცესი გაცილებით რთული და ხანგრძლივი აღმოჩნდა, ვიდრე თავდაპირველად იყო დაგეგმილი. პროექტის განხორციელებისას გაჩნდა ტექნიკური, ფინანსური და პოლიტიკური პრობლემები, რის გამოც იორნ უტზონმა საბოლოოდ დატოვა პროექტი 1966 წელს. მიუხედავად ამისა, შენობა დასრულდა 1973 წელს და მალევე იქცა ავსტრალიის მთავარ კულტურულ სიმბოლოდ.
<br><br>ოპერის თეატრი ოფიციალურად გახსნა Elizabeth II-მა 1973 წლის 20 ოქტომბერს. მოგვიანებით, 2007 წელს, იგი შეიტანეს UNESCO-ს მსოფლიო მემკვიდრეობის სიაში, რაც კიდევ ერთხელ უსვამს ხაზს მის გლობალურ მნიშვნელობას.
<br><br>სიდნეის ოპერის თეატრი არის მრავალფუნქციური კულტურული ცენტრი, რომელიც მოიცავს რამდენიმე დარბაზს. აქ იმართება ოპერები, ბალეტები, დრამატული წარმოდგენები, კონცერტები და თანამედროვე ხელოვნების ღონისძიებები. თეატრის მთავარი პარტნიორები არიან Opera Australia, The Australian Ballet და Sydney Symphony Orchestra.
<br><br>მის სცენაზე არაერთხელ დადგმულა მსოფლიო კლასიკის შედევრები, როგორიცაა La Traviata, Carmen, Swan Lake და The Nutcracker. ასევე აქ ტარდება თანამედროვე მუსიკალური და ექსპერიმენტული წარმოდგენები, რაც თეატრს მრავალფეროვან კულტურულ სივრცედ აქცევს.
<br><br>დღეს სიდნეის ოპერის თეატრი ითვლება არა მხოლოდ ავსტრალიის, არამედ მთელი მსოფლიოს კულტურულ სიმბოლოდ. მისი არქიტექტურა დიდ გავლენას ახდენს თანამედროვე თეატრების დიზაინზე, განსაკუთრებით ოპერისა და ბალეტის სივრცეებზე, სადაც განსაკუთრებული ყურადღება ეთმობა აკუსტიკას, სცენის მოქნილობასა და ვიზუალურ ეფექტებს. ბევრი თანამედროვე საკონცერტო დარბაზი და ბალეტის თეატრი შთაგონებულია მისი ინოვაციური ფორმებითა და ტექნიკური გადაწყვეტებით.
 </span>
<img src="images/sid.jpg">
<span>გარდა არქიტექტურული გავლენისა, სიდნეის ოპერის თეატრი მნიშვნელოვან როლს ასრულებს საერთაშორისო კულტურულ ცხოვრებაში. იგი მასპინძლობს მსოფლიო დონის ფესტივალებს, გასტროლებს და საერთაშორისო კოლაბორაციებს, რაც ხელს უწყობს სხვადასხვა ქვეყნის ხელოვანებს შორის კავშირების გაძლიერებას. სწორედ ამიტომ, იგი დღემდე რჩება შთაგონების წყაროდ არქიტექტორებისთვის, მუსიკოსებისთვის, რეჟისორებისთვისა და ქორეოგრაფებისთვის მთელ მსოფლიოში.</span>
</div>`)

L.marker([45.467529983793185, 9.18958338320867]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/lascala.jpg">
    <span style="font-weight: bold;">ლა სკალა</span>
    <span>ლა სკალა არის საოპერო ხელოვნების ერთ-ერთი მნიშვნელოვანი სახლი, რომელიც მდებარეობს იტალიაში, მილანში. შენობა აგებულია 1776-78 წლებში არქიტექტორ ჯუზეპე პიერმარინის მიერ მარი-ტერეზა ავსტრიელის დაკვეთით მას შემდეგ, რაც ხანძრის გამო ძველი საჰერცოგო თეატრი განადგურდა. შენობა მდებარეობს იმ ადგილას სადაც ადრე იდგა გოთიკური ეკლესია ,,სანტა მარია ლა სკალა", სწორედ აქედან მოდის თეატრის სახელწოდებაც. თავად ,, ლა სკალა" კი ამ ეკლესიას სახელში საკუთარი სახელია და გვარზე მიგვანიშნებს, რომელიც შუა საუკუნეებში იტალიაში და განსაკუთებით ვერონაში იყო ცნობილი. არსებობს მეორე ვერსიაც რომ თეატრის სახელში იგულისხმება თეატრი კიბეზე, რადგან აღნიშნული იტალიურად კიბეს ნიშნავს.
 </span>
<img src="images/ska.jpg">
<span>
თეატრისთვის საძირკველის გათხრისას მშენებლებმა უზარმაზარ მარმარილოს ფილას მიაგნეს პილადის - ძველრომაული მამის გამოსახულებით, რაც ქალაქის მესვეურებმა კეთილ ნიშნად მიიჩნიეს, რადგან კიდევ ერთხელ დარწმუნდნენ, რომ სწორად შეარჩიეს ადგილი მშენებლობისთვის.
<br><br>კლასიციზმის სტილში აგებული შენობა, რომლის დარბაზს ლომბარდიის სხვა თეატრების მსგავსად ნალის ფორმა ჰქონდა, არა მხოლოდ იდეალური აკუსტიკით, არამედ უნიკალური ინტერიერითაც გამოირჩეოდა. მეტიც, ბოჰემური ბროლის ჭაღი, რომელიც შუშის სასახლეს ჰგავდა და 400 ნათურით ნათდებოდა, მე-18 საუკუნის ბოლოს დიზაინის ნამდვილ შედევრად იქცა. სამწუხაროდ, დღეს ლა სკალას დარბაზს პირვანდელი ჭაღის მხოლოდ ასლი ამშვენებს, რადგან შეუძლებელი აღმოჩნდა მეორე მსოფლიო ომისა და ქალაქის ინტენსიური დაბომბვის დროს დაზიანებული ორიგინალის აღდგენა. აქვე აღსანიშნავია ისიც, რომ ლა სკალა პირველი საზოგადოებრივი დაწესებულებაა ევროპაში, რომელიც ელექტროენერგიით მომარაგდა. პირველად თეატრი 1883 წლის 25 დეკემბერს განათდა ამილკარე პონკიელის ოპერის "ჯოკონდას" პრემიერის აღსანიშნად, როცა თეატრში ერთდროულად 2450 ნათურა აინთო. მანამდე დარბაზი მხოლოდ სანთლებით ნათდებოდა, ამიტომ ის, ვისაც პარტერში ჰქონდა ადგილი დაკავებული ქუდის მოხდას ერიდებოდა, რადგან გამდნარი ცვილით თავის დაწვას უფრთხოდა. თეატრს არ ჰქონდა არც გათბობის სისტემა, რაც განსაკუთრებით პრობლემური ზამთრის სეზონზე იყო, როცა რესპექტაბელური პუბლიკა ქურქებსა და ბეწვის მოსასხამებში გახვეული სტუმრობდა ლა სკალას, მით უფრო, რომ თავიდან თეატრში არა მხოლოდ მუსიკალური წარმოდგენები, არამედ მეჯლისები, აზარტული თამაშები და კორიდაც კი იმართებოდა.
 </span>
<img src="images/skala.jpg">
<span>
აღსანიშნავია, რომ თეატრის მშენებლობასა და ინტერიერის გაფორმებაზე იმ პერიოდისთვის წარმოუდგენელი თანხა - 1 მილიონი ლირა დაიხარჯა, რომლის დაფარვა ქალაქის 90-მა არისტოკრატმა ითავა. რა თქმა უნდა, ასწლეულების მანძილზე თეატრმა მრავალგზის რეკონსტრუქცია განიცადა და მნიშვნელოვნად გაფართოვდა, ამიტომ გასაკვირი არაა, რომ დღეს ლა სკალას საკონცერტო დარბაზი 2030 მაყურებელს იტევს და ევროპაში უდიდესი - 100 კვადრატული მეტრის საორკესტრო ორმო აქვს.
 </span>
<img src="images/la.jpg">
<span>
ოფიციალურად თეატრი 1778 წლის 3 აგვისტოს გაიხსნა ანტონიო სალიერის ოპერით ,,l'Europa riconosciuta" ("აღიარებული ევროპა"), რომელიც სპეციალურად ღირსშესანიშნავი თარიღისთვის დაიწერა. მართალია,თავისი წვლილი თეატრის პოპულარიზაციაში ცნობილმა კომპოზიტორებმა ჯაკომო პუჩინიმ, არტურო ტოსკანინიმ, ჯოაკინო როსინიმ და გაეტანო დონიცეტიმ შეიტანეს, მაგრამ ნამდვილი აღიარება ლა სკალამ 1842 წელს ჯუზეპე ვერდის "ნაბუქოს" ტრიუმფალური წარმატების შემდეგ მოიპოვა.
 
<br><br>საინტერესოა ისიც რომ, პარიზის მსგავსად მილანშიც არსებობდა ე.წ. "აპლოდისმენტების სააგენტო", რომელიც მსურველებს პროფესიონალი "ტაშის დამკვრელებით" უზრუნველყოფდა. სააგენტოს მომსახურებით ხშირად სარგებლობდა ლა სკალას ხელმძღვანელობაც, რომელიც მამაკაც "ტაშისმკვრელებს" 25 ლირას, ქალბატონებს კი, 15 ლირას უხდიდა.
<br><br>2002 წლის 19 იანვარს შენობა დაიხურა განახლებისთვის საჭირო სამუშაოების გამო. განახლებას ხელმძღვანელობდა არქიტექტორი მარიო ბოტა. ხელახალ გახსნას 2004 წლის 7 დეკემბერს სალიერის იმავე ოპერით შედგა, რითაც თავდაპირველად გაიხსნა.
<br><br>ლა სკალაში მუსიკალური სეზონი ტრადიციულად იხსნება 7 დეკემბერს, მილანის მფარველი წმინდა ამბროსის დღეს. ამავე შენობაში არის ლა სკალას მუზეუმი, სადაც ინახება სასცენო ნახატების, დეკორაციების, ქანდაკებების, კოსტიუმების უდიდესი კოლექცია. თეატრს ასევე აქვს ასოცირებული სკოლა, რომელიც ცნობილია როგორც La Scala Theatre Academy (იტალ. Accademia Teatro alla Scala), რომელიც სთავაზობს სხვადასხვა ქვეყნის ახალგაზრდა არტისტებს პროფესიულ ტრენინგს მუსიკაში, ცეკვაში, სცენაზე და სცენის მენეჯმენტში.
<br><br>ლა სკალას სპექტაკლებში სხვადასხვა დროს მონაწილეობა აქვთ მიღებული ქართველ მომღერლებს: ფ. ქორიძეს (1870-71), პ. ბურჭულაძეს, ვლ. ათანელიშვილს, ბ. მაისურაძეს, ი. ალიბეგაშვილს, ნ. სურგულაძეს, ა. რაჭველიშვილს, ნ. მაჩაიძეს, ს. მჭედლიშვილს, გ. გაგნიძეს და სხვ.
<br><br>სხვა თეატრების მსგავსად, ლა სკალასაც ჰყავს თავისი მოჩვენება. მეტიც, ლეგენდის თანახმად, თეატრში ერთდროულად ორი აჩრდილი ცხოვრობს, რადგან მე-19 საუკუნის ცნობილ სოპრანოსთან მარია მალიბრანისთან ერთად, 1977 წელს ლა სკალაში მარია კალასის აჩრდილიც დაბინავდა. კალასის დებიუტი მილანური თეატრის სცენაზე 1950 წელს შედგა, ერთი წლის შემდეგ კი, სოპრანომ რენატა ტებალდი შეცვალა ვერდის ოპერა "აიდაში", რომლის წყალობით "იტალიელი პრიმადონების დედოფლის" ტიტული მოიპოვა.</span>
</div>`)

L.marker([40.77293507127703, -73.9838867458519]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/mee.jpg">
    <span style="font-weight: bold;">მეტროპოლიტენის ოპერის ასოციაცია</span>
    <span>მეტროპოლიტენის ოპერის თეატრი, ანუ Metropolitan Opera, ერთ-ერთი ყველაზე მნიშვნელოვანი და გავლენიანი საოპერო ინსტიტუტია მსოფლიოში, რომელიც დაარსდა 1880 წლის აპრილში New York City-ში. მისი შექმნა უკავშირდება იმდროინდელ ამერიკულ საზოგადოებაში კლასიკური მუსიკისა და ოპერის მიმართ მზარდ ინტერესს, რის შედეგადაც შეიქმნა ძლიერი კულტურული ცენტრი, რომელიც მიზნად ისახავდა ევროპული დონის ოპერის განვითარებას ამერიკაში. მიუხედავად იმისა, რომ ორგანიზაცია 1880 წელს ჩამოყალიბდა, მისი პირველი საოპერო წარმოდგენა გაიმართა 1883 წლის 22 ოქტომბერს, როცა შესრულდა Charles Gounod-ს ოპერა „Faust“, რაც მეტროპოლიტენის ოპერის ოფიციალურ კულტურულ დასაწყისად ითვლება. თავდაპირველად თეატრი ბროდვეიზე მდებარეობდა და მალევე გახდა ერთ-ერთი ყველაზე პოპულარული საოპერო სივრცე ქალაქში, თუმცა 1892 წელს მომხდარმა ხანძარმა სერიოზული ზიანი მიაყენა შენობას და დროებით შეაჩერა მისი საქმიანობა. მიუხედავად ამისა, თეატრი აღდგა და გააგრძელა ფუნქციონირება, თანდათან კი მისი რეპუტაცია უფრო და უფრო გაიზარდა.
<br><br>მე-20 საუკუნის შუა პერიოდისთვის მეტროპოლიტენის ოპერა უკვე ჩამოყალიბდა, როგორც მსოფლიო დონის საოპერო ცენტრი, რომელიც თანაბრად დადგა ისეთ ლეგენდარულ თეატრებთან, როგორიცაა La Scala, Royal Opera House და Bolshoi Theatre. მისი წარმატება დიდწილად განაპირობა იმან, რომ თეატრში მოღვაწეობდნენ გამოჩენილი დირიჟორები და მუსიკოსები, მაგალითად Arturo Toscanini და Gustav Mahler, ასევე მსოფლიო დონის საოპერო მომღერლები, რომლებმაც მეტროპოლიტენის სცენა ერთ-ერთ ყველაზე პრესტიჟულ ადგილად აქციეს. განსაკუთრებული ადგილი უჭირავს Enrico Caruso-ს, რომელმაც 1903 წელს აქ დებიუტი შეასრულა და მრავალი წლის განმავლობაში იყო თეატრის ერთ-ერთი მთავარი ვარსკვლავი. მოგვიანებით სცენაზე გამოვიდნენ ისეთი ლეგენდარული მომღერლები, როგორებიც არიან Maria Callas, Luciano Pavarotti და Plácido Domingo, რომელთაც განსაკუთრებული გავლენა მოახდინეს საოპერო ხელოვნების პოპულარიზაციაზე. 
 
<br><br> 	1966 წელს მეტროპოლიტენის ოპერა გადავიდა Lincoln Center-ში, სადაც დღემდე ფუნქციონირებს. ეს ცენტრი აერთიანებს ნიუ-იორკის წამყვან კულტურულ დაწესებულებებს და თავად ოპერის შენობა გამოირჩევა როგორც მასშტაბით, ასევე აკუსტიკით. მისი დარბაზი დაახლოებით 3800 მაყურებელს იტევს, რაც მას ერთ-ერთ ყველაზე დიდ საოპერო დარბაზად აქცევს მსოფლიოში. ამ ყველაფერმა მეტროპოლიტენის ოპერას მიანიჭა მსოფლიო მნიშვნელობა და იგი დღესაც ითვლება კლასიკური მუსიკის ერთ-ერთ უმთავრეს ცენტრად, სადაც წარმოდგენილია ოპერის საუკეთესო ტრადიციები და მაღალი პროფესიონალიზმი. 
</span>
<img src="images/metro.jpg">
<span>

  დღეს მეტროპოლიტენის ოპერა არის არა მხოლოდ თეატრი, არამედ მასშტაბური კულტურული ორგანიზაცია, რომელიც ყოველწლიურად დაახლოებით 240 საოპერო წარმოდგენას მართავს და აქტიურად ავითარებს საოპერო ხელოვნებას. მისი სეზონი გრძელდება სექტემბრიდან აპრილამდე და ამ პერიოდში სპექტაკლები თითქმის ყოველდღიურად იმართება, რაც აჩვენებს რამდენად ინტენსიური და დატვირთულია მისი საქმიანობა. ზაფხულის თვეებში თეატრი ხშირად ატარებს ტურნეებს ან აწყობს უფასო წარმოდგენებს ქალაქის პარკებსა და საჯარო სივრცეებში, რაც საშუალებას აძლევს ფართო საზოგადოებასაც გაეცნოს ოპერის ხელოვნებას. თეატრს ჰყავს საკუთარი ორკესტრი და გუნდი, ხოლო სოლისტები და დირიჟორები ხშირად კონტრაქტით არიან მოწვეული, რაც უზრუნველყოფს მაღალი დონის პროფესიონალიზმს. 
<br><br>რეპერტუარი შედგება მსოფლიო კლასიკური ოპერებისგან და ყველა შესრულება ხდება ორიგინალურ ენაზე, რაც ძალიან მნიშვნელოვანია ოპერის ავთენტურობის შესანარჩუნებლად. წარმოდგენილია ისეთი კომპოზიტორების ნაწარმოებები, როგორებიც არიან Pyotr Ilyich Tchaikovsky, Mikhail Glinka და Nikolai Rimsky-Korsakov. თეატრის ინტერიერი განსაკუთრებულად გამოირჩევა — ფოიეში განთავსებულია Marc Chagall-ის ორი მონუმენტური ფრესკა, რომლებიც 1966 წლიდან ამშვენებს შენობას და მის ერთ-ერთ მთავარ სიმბოლოდ ითვლება.
</span>
<img src="images/me.jpg">
<span>
 
მიუხედავად მისი წარმატებისა და მსოფლიო აღიარებისა, მეტროპოლიტენის ოპერა ბოლო წლებში სერიოზულ ფინანსურ გამოწვევებს აწყდება, რაც განსაკუთრებით გაძლიერდა COVID-19 პანდემიის შემდეგ. ორგანიზაციის ხარჯები მნიშვნელოვნად აღემატება შემოსავალს, რის გამოც ხელმძღვანელობა იძულებულია მიიღოს რთული გადაწყვეტილებები, მათ შორის თანამშრომლობა სხვა ქვეყნებთან და გარკვეული აქტივების, მაგალითად ხელოვნების ნიმუშების, გაყიდვის განხილვა. ერთ-ერთი ასეთი მაგალითია მარკ შაგალის ფრესკების გაყიდვის იდეა, რომლის ღირებულება ათეულ მილიონ დოლარს აღწევს. 
<br><br>მიუხედავად ამ სირთულეებისა, მეტროპოლიტენის ოპერა კვლავ რჩება ერთ-ერთ ყველაზე პრესტიჟულ და გავლენიან კულტურულ ინსტიტუტად მსოფლიოში. მისი სცენა დღემდე არის ადგილი, სადაც იკრიბებიან საუკეთესო მომღერლები, დირიჟორები და მუსიკოსები, ხოლო წარმოდგენები ინარჩუნებს უმაღლეს ხარისხს. ამ თეატრს აქვს უდიდესი მნიშვნელობა არა მხოლოდ ამერიკისთვის, არამედ მსოფლიო კულტურისთვისაც, რადგან იგი აგრძელებს ოპერის ტრადიციების დაცვას, განვითარებას და ახალი თაობებისთვის გადაცემას.</span>
</div>`)

L.marker([48.87204023942421, 2.331622854549688]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/garnie.jpg">
    <span style="font-weight: bold;">ოპერა გარნიე</span>
    <span>გარნიეს სასახლე პარიზის დიდი რეკონსტრუქციის გეგმის ნაწილი იყო, რომელიც საფრანგეთის მეორე იმპერიის პერიოდში ნაპოლეონ III-მ ჩაიფიქრა. ამ მიზნისთვის მან სამოქალაქო მშენებელი (ქალაქმგეგმავი) ბარონი ოსმანი შეარჩია.1858 წლის 14 იანვარს, ლე პალეტიეს ქუჩაზე, სადაც დღევანდელი გარნიეს ოპერა მდებარეობს, იტალიელი ანარქისტები ნაპოლეონ III-ზე თავდასხმას ახორციელებენ. მართალია მთავარი სამიზნე გადარჩა, მაგრამ რვა ადამიანი დაიღუპა და დაახლოებით ასორმოცდაათი დაიჭრა. ზუსტად მეორე დღეს ამ ადგილზე იმპერატორმა ახალი დარბაზის აგება გადაწყვიტა. ნაპოლეონმა ოსმანს უფლება მისცა შენობის ადგილისთვის 12.000 კვ.მ. მიწა გაეთავისუფლებინათ.1861 წელს გამოცხადდა კონკურსი „მუსიკისა და ცეკვის საიმპერატორო აკადემიის“ ( როგორც თავდაპირველად ეწოდა ოპერა გარნიეს)  პროექტზე. 171 კონკურსანტს შორის იყო ახალგაზრდა არქიტექტორი შარლ გარნიე. პროექტში მონაწილეებს ანონიმურობის დაცვისათვის მიჩნეული ჰქონდათ ნომრები და საკუთარი დევიზი. გარნიეს ნომერი იყო 38, დევიზი კი - „მე ბევრის იმედი მაქვს და ცოტას ველი“.
 <br><br>1861 წელს, 30 მაისს ჟიურიმ, რომლის თავმჯდომარე იყო ნაპოლეონ I-ის შვილი, პრინცი ვალევსკი, გამარჯვებულად ცნო 39 წლის ჯერ კიდევ უცნობი არქიტექტორი შარლ გარნიე. პროექტისთვის გამოიყო 29 მილიონი ფრანკი, თუმცა შემდეგში მას ფინანსთა მინისტრმა 30% ჩამოაჭრა. 
 <br><br>ადგილი, სადაც ოპერის შენობა უნდა აგებულიყო, გარშემორტყმული იყო მაღალი შენობებით და მათ ასიმეტრიული რომბისებური ფორმა ჰქონდათ. გარნიეს ამ შენობების აღება და მათ მაგივრად ბაღების გაშენება სურდა, რათა მნახველებს უფრო უკეთ შეეფასებინათ ახალი შენობის მთელი სიდიადე, მაგრამ ოსმანმა მას ამის უფლება არ მისცა. რამდენადაც მეზობელი შენობები გაცილებით მაღალი იყო ვიდრე გარნიეს მიერ დაგეგმილი ოპერის შენობა, არქიტექტორი იძულებული გახდა უკანასკნელ მომენტში შეეცვალა პროექტი და დაემატებინა ატიკური სართული, რათა საიმპერატორო სასახლეს საჭირო პომპეზურობა შეენარჩუნებინა. შენობის საძირკველი იმავე წელს ჩაიყარა, მშენებლობა კი 1962 წელს დაიწყო.
  <br><br>ლეგენდის თანახმად, მშენებლობის პერიოდში ნაპოლეონის მეუღლე ევგენიას გარნიესთვის უკითხავს თუ რომელ სტილში აშენდებოდა თეატრი — ბერძნულში თუ რომაულში, გარნიემ უპასუხა: "ეს ნაპოლეონ III-ის სტილი იქნება, მადამ!"
  <br><br>მშენებლობის პროცესი ძლიერ გაჭიანურდა. ერთ-ერთი მთავარი პრობლემა, რომელიც ბეტონის საძირკვლის ჩაყრას ხელს უშლიდა, იყო ჭაობიანი ნიადაგი, რომელიც ნესტს მიწისქვეშა წყლებისგან ისრუტავდა. საძირკვლიდან წყლის ამოტუმბვას რვა თვე დასჭირდა. შემდგომი გაჭიანურების მიზეზი ჯერ საფრანგეთ-პრუსიის ომი გახდა, შემდეგ მეორე იმპერიის დაცემა, ბოლოს კი პარიზის კომუნა. ამ პერიოდში მშენებლობა კანტიკუნტად გრძელდებოდა. ერთი პერიოდი ჭორიც გავრცელდა, რომ თეატრის მშენებლობა საერთოდ შეწყდებოდა. გარნიეს სასახლის დასრულებას შემდგომი იმპულსი მისცა 1873 წლის 29 ოქტომბერს ძველი პარიზის ოპერის შენობის ხანძარმა, რომელიც 27 საათის განმავლობაში მძვინვარებდა და რომელმაც თეატრის შენობასთან ერთად თითქმის მთელი უბანი გაანადგურა. ეს შენობა პარიზის მუსიკის სამეფო აკადემიის მთავარი დარბაზი იყო და მის სცენაზე ოპერისა და ბალეტის მრავალი მსოფლიო შედევრი დადგმულა. შესაბამისად, მსოფლიოს უმნიშვნელოვანეს საოპერო და საბალეტო დასს სასწრაფოდ სჭირდებოდა შესაფერისი ახალი შენობა.
  <br><br>1874 წლის ბოლოსთვის გარნიემ მუშათა მასიურ არმიასთან ერთად სასახლის მშენებლობა დაასრულა, რასაც მთელი პარიზი ზეიმით შეხვდა. სასახლის ფორმალური ინაუგურაცია 1875 წლის 15 იანვარს შედგა გრანდიოზული გალა კონცერტით. საზეიმო ბალის რეპერტუარი შედგებოდა ფრომენტალ ჰალევის 1835 წლის ოპერა "La Juive" (ებრაელი ქალი) მესამე აქტისგან, ჯაკომო მეიერბეერის 1836 წლის ოპერა "Les Hugenots" (ჰუგენოტები) ნაწყვეტებთან ერთად. საბალეტო დასმა შეასრულა გრან დივერტისმენტი პარიზის ოპერის ბალეტმეისტერი ლუი მერანტეს მიერ, რომელიც შედგებოდა განთქმული სცენისგან "Le Jardin Animé" იოზეფ მაზიერის 1867 წლის განახლებული "Le Corsaire"-დან (კორსიკელი), ლეო დელიბეს მუსიკის თანხლებით.
  <br><br>ოპერის შენობის საბოლოო გახსნას 1875 წლის 28 ოქტომბერს ესწრება რესპუბლიკის პრეზიდენტი მაკ-მაონი, ლონდონის ლორდ-მერი, ამსტერდამის ბურგმისტრი, ესპანეთის სამეფო ოჯახი და ორი ათასამდე მოწვეული სტუმარი სხვადასხვა ქვეყნიდან. წარმოდგენილ იქნა ჯაკომო მეიერბერის ჰუგენოტებიდან და ლუდვიკ ჰალევის ებრაელი ქალიდან ნაწყვეტები. პრეზენტაციაზე თავად არქიტექტორი მიწვეული კი იყო, მაგრამ მას უნდა გადაეხადა მეორე ლოჟაში ადგილის ფასი. ამ ფაქტმა დიდი აღშფოთება დაიმსახურა პრესაში. თუმცა ეს იყო სიმბოლო იმისა, რომ ახალ ხელისუფლებას არ სურდა კავშირი ჰქონოდა იმ ადამიანებთან, რომლებიც იმპერატორს ემსახურებოდნენ.
 <br><br>გარნიეს ქმნილებაში სხვადასხვა სტილი ერთმანეთში ირევა, მაგრამ ყველას ბაროკო სჭარბობს. არქიტექტორის მთავარი შთაგონების წყარო იყო ბორდოს დიდი თეატრი და გვიანი რენესანსის იტალიური სასახლეები. შენობის არქიტექტურა გამოირჩევა გამოყენებული მასალების მრავალფეროვნებით. ,,ნაპოლეონ  III-ის სტილის " ოპერის თეატრი მოიცავდა ბაროკოს, პალადიოს კლასიციზმისა და რენესანსის არქიტექტურის ელემენტებს. ეს ელემენტები შერწყმული იყო ღერძულ სიმეტრიასთან და თანამედროვე ტექნიკასა და მასალებთან, მათ შორის რკინის კარკასის გამოყენებასთან, რომელიც ნაპოლეონ III-ის სხვა შენობებში იყო გამოყენებული, მათ შორის ეროვნულ ბიბლიოთეკასა და ლე ოლეს ბაზრებში. 
 </span>
<img src="images/gar.jpg">
<span>
  გარნიეს სასახლე, რომლის ფართობი 11.000 კვ.მ-ია, დაახლოებით 2,200 ადამიანს იტევს. დარბაზის ცენტრალური აბაჟურის წონა ექვს ტონას აღემატება. დარბაზის უზარმაზარი სცენა 450 მსახიობს იტევს.
   </span>
<img src="images/nie.jpg">
<span>
1896 წელს აბაჟურის ერთ-ერთი გადამწონი ჩამოვარდა სპექტაკლის დროს და ერთი მაყურებელი იმსხვერპლა. ეს ფაქტი, ასევე მიწისქვეშა ტბა და საოპერო თეატრის სხვა ელემენტები გახდა 1910 წელს გასტონ ლეროს შთაგონება მისი კლასიკური გოტიკური რომანისთვის "ოპერის უჩინმაჩინი" (Le Fantôme de l'Opéra).</span>
    </div>`)

L.marker([48.203595035558145, 16.369203396843126]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/vienna.jpg">
    <span style="font-weight: bold;">ვენის სახელმწიფო ოპერა</span>
    <span>ვენის ოპერისა და ბალეტის თეატრი (Vienna State Opera) არის მსოფლიოს ერთ-ერთი ყველაზე მნიშვნელოვანი კულტურული დაწესებულება, რომელიც მდებარეობს ავსტრიის დედაქალაქ ვენაში და წარმოადგენს კლასიკური მუსიკისა და თეატრალური ხელოვნების მნიშვნელოვან ცენტრს. მისი მშენებლობა დაიწყო 1861 წელს, ავსტრიის იმპერიის პერიოდში, როდესაც ქალაქში აქტიურად მიმდინარეობდა დიდი არქიტექტურული პროექტების განხორციელება. შენობა აშენდა ავსტრიელი არქიტექტორების - ავგუსტ ზიკარდ ფონ ზიკარდსბურგისა და ედუარდ ვან დერ ნიულის - პროექტის მიხედვით და წარმოადგენს ნეორენესანსის სტილის ერთ-ერთ გამორჩეულ ნიმუშს. მიუხედავად იმისა, რომ დღეს იგი ერთ-ერთ ყველაზე ლამაზ და შთამბეჭდავ შენობად ითვლება, თავდაპირველად საზოგადოების მხრიდან საკმაოდ მკაცრი კრიტიკა დაიმსახურა, რამაც ერთ-ერთი არქიტექტორისთვის მძიმე პირადი შედეგიც კი გამოიწვია.
<br><br>თეატრი ოფიციალურად გაიხსნა 1869 წელს, როდესაც შესრულდა ვოლფგანგ ამადეუს მოცარტის ოპერა „დონ ჯოვანი“. გახსნის დღიდანვე ვენის ოპერა გახდა მაღალი დონის მუსიკალური წარმოდგენების ცენტრი და სწრაფად მოიპოვა საერთაშორისო აღიარება. აქ იდგმებოდა ისეთი ცნობილი კომპოზიტორების ნამუშევრები, როგორებიც არიან ჯუზეპე ვერდი, რიხარდ ვაგნერი და პიოტრ ილიჩ ჩაიკოვსკი, ხოლო სცენაზე გამოდიოდნენ მსოფლიოს წამყვანი მომღერლები და დირიჟორები.
 </span>
<img src="images/vena.jpg">
<span>
<br><br>მეორე მსოფლიო ომის დროს, 1945 წელს, შენობა ძლიერ დაზიანდა დაბომბვის შედეგად და მისი დიდი ნაწილი განადგურდა, თუმცა ომის შემდეგ დაიწყო მისი აღდგენა. რეკონსტრუქცია დასრულდა 1955 წელს და თეატრი ხელახლა გაიხსნა ლუდვიგ ვან ბეთჰოვენის ოპერით „ფიდელიო“, რაც ქვეყნის კულტურული აღორძინების სიმბოლოდ იქცა.
<br><br>ვენის ოპერა გამოირჩევა იმით, რომ სეზონის განმავლობაში თითქმის ყოველდღიურად ტარდება ოპერისა და ბალეტის წარმოდგენები, რაც იშვიათია სხვა თეატრებისთვის. ასევე განსაკუთრებულია მისი აკუსტიკა, რომელიც ერთ-ერთ საუკეთესოდ მიიჩნევა მსოფლიოში და უზრუნველყოფს მუსიკის სრულყოფილად აღქმას. თეატრი ცნობილია თავისი ტრადიციებითაც, განსაკუთრებით კი ყოველწლიური ვენის ოპერის ბალით, რომელიც მსოფლიო ელიტის ერთ-ერთ ყველაზე პრესტიჟულ ღონისძიებად ითვლება. ასევე აღსანიშნავია ე.წ. დგომის ბილეთები, რომლებიც სტუდენტებსა და ახალგაზრდებს საშუალებას აძლევს, დაბალ ფასად დაესწრონ მაღალი დონის წარმოდგენებს.
<br><br>დღეს ვენის ოპერისა და ბალეტის თეატრი წარმოადგენს არა მხოლოდ ავსტრიის კულტურის ცენტრს, არამედ მთელი მსოფლიოსთვის ერთ-ერთ ყველაზე ავტორიტეტულ სცენას, სადაც ტრადიცია და თანამედროვე ხელოვნება ჰარმონიულად ერთიანდება.</span>
    </div>`)

L.marker([51.51298784128817, -0.12227270482572296]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/lond.jpg">
    <span style="font-weight: bold;">სამეფო ოპერის თეატრი</span>
    <span>სამეფო თეატრი კოვენტ გარდენი - Theatre Royal Covent Garden - ლონდონის ერთ-ერთი ყველაზე მნიშვნელოვანი კულტურული ცენტრია, რომლის ისტორია თითქმის სამ საუკუნეს მოიცავს და მჭიდროდ უკავშირდება ოპერისა და ბალეტის განვითარებას ევროპაში.
თეატრი 1732 წელს გაიხსნა იმპრესარიო ჯონ რიჩი-ის ინიციატივით. გახსნის საღამოზე წარმოდგენილი იყო სამყაროს გზა - უილიამ კონგრივი-ის პიესა. ეს მოვლენა მნიშვნელოვანი იყო ლონდონის კულტურულ ცხოვრებაში, რადგან თეატრი სწრაფად იქცა ერთ-ერთ მთავარ სცენად.
</span>
<img src="images/bru.jpg">
<span>
თავდაპირველად კოვენტ გარდენი ერთ-ერთი იმ ორი თეატრიდან იყო, რომელსაც ჩარლზ II-ის ბრძანებით დრამატული წარმოდგენების დადგმის უფლება ჰქონდა - მეორე იყო Theatre Royal Drury Lane. ეს ხაზს უსვამს თეატრის განსაკუთრებულ სტატუსს იმ დროის ინგლისში.
1734 წელს აქ დაიდგა ბალეტი „პიგმალიონი“, სადაც მთავარ პარტიას ასრულებდა მარი სალე. იგი ცნობილია იმით, რომ სცენაზე კორსეტის გარეშე გამოვიდა, რამაც ბალეტის განვითარებაზე დიდი გავლენა მოახდინა.
იმავე პერიოდში თეატრი საოპერო ცენტრადაც ჩამოყალიბდა. განსაკუთრებული როლი ითამაშა კომპოზიტორმა გეორგ ფრიდრიხ ჰენდელი-მა. მის ოპერებს შორის აღსანიშნავია „ერთგული მწყემსი“ და არიოდანტე, რომლებმაც თეატრს საერთაშორისო მნიშვნელობა მიანიჭა.
<br><br>1808 წელს თეატრი ხანძრის შედეგად დაიწვა, თუმცა მალევე აღდგა არქიტექტორ რობერტ სმიორკი-ის პროექტით და 1809 წელს გაიხსნა მაკბეტი-ით. ბილეთების ფასის ზრდამ მაშინ საზოგადოების პროტესტი გამოიწვია, რის გამოც თეატრის ხელმძღვანელობა იძულებული გახდა ფასები შეემცირებინა - ეს შემთხვევა აჩვენებს მაყურებლის გავლენას კულტურულ პროცესებზე.
<br><br>
თანამედროვე შენობა 1858 წელს აშენდა და 1990-იან წლებში საფუძვლიანად განახლდა. დღეს თეატრი დაახლოებით 2300 მაყურებელს იტევს და წარმოადგენს Royal Opera House-ის მთავარ სცენას.
</span>
<img src="images/brah.jpg">
<span>
დღეს კოვენტ გარდენი ერთ-ერთი გამორჩეული თეატრია არა მხოლოდ ბრიტანეთში, არამედ მთელ ევროპაში - იგი აერთიანებს ისტორიულ ტრადიციებსა და თანამედროვე ხელოვნებას და დღემდე რჩება მსოფლიო თეატრალური კულტურის მნიშვნელოვან ცენტრად.
</span>
    </div>`)

L.marker([-34.601054829882194, -58.383295617002844]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/colon.jpg">
    <span style="font-weight: bold;">თეატრი კოლონი</span>
    <span>თეატრი კოლონი არის მთავარი ოპერის თეატრი ბუენოს-აირესში.  National Geographic-ი მას მსოფლიოს სამ საუკეთესო ოპერის თეატრს შორის ასახელებს.ასევე მოიაზრება 5 საუკეთესო საკონცერტო დარბაზს შორის.
<br><br> არსებულმა შენობამ ჩაანაცვლა ძველი თეატრი, რომელიც 1857 წელს იყო გახსნილი. ფრანჩესკო ტამბურინის პროექტით მშენებლობა დაახლოებით 20 წელი მიმდინარეობდა (1889-1908). ახალი შენობა 1908 წლის 25 მაისს ჯუზეპე ვერდის ,,აიდით" გაიხსნა.
<br><br> თეატრი განახლების მიზნით 2006 წლის ოქტომბრიდან, 2010 წლის მაისამდე დახურული იყო ის ხელახალა 2010 წლის 24 მაისს გაიხსნა.
 თეატრი შემოსაზღვრულია: განიერი 9-დე-ხულიო-ავენიუ-თი, თავისუფლების ქუჩით (Libertad Street) მთავარი შესასვლელის მხარეს, არტურო ტოსკანინის ქუჩით და ტუკომანის ქუჩით.
 აუდიტორია განლაგებულია ნალისებურად. აქვს 2,487 დასაჯდომი, 1000 დასადგომი ადგილი. თეატრის ესტრადა არის: 20 მეტრის სიგანის, 15 მეტრის სიმაღლის და 20 მეტრის სიღრმის.
</span>
    <img src="images/kol.webp">
    <span>
 ლუჩანო პავაროტის შეფასებით თეატრია აკუსტიკური მახასიათებლებით, მსოფლიოს საუკეთესო ხუთეულში შედის.   თეატრი აღჭურვილია ყველა თანამედროვე თეატრალური ტექნოლოგიური საშუალებით. კლასიკურ დადგმებთან ერთად ყოველთვის უთმობს სცენას თანამედროვე ექსპერიმენტურ სპექტაკლებს. </span>
    </div>`)

L.marker([55.76026024290703, 37.61862713959646]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/moscow.jpg">
    <span style="font-weight: bold;">რუსეთის სახელმწიფო აკადემიური დიდი თეატრი</span>
    <span>რუსეთის სახელმწიფო აკადემიური დიდი თეატრი (The Bolshoi Theatre)

დიდი თეატრის ისტორია 1776 წელს იწყება, როდესაც ეკატერინე დიდმა თავად პიოტრ ურუსოვს მოსკოვში თეატრალური წარმოდგენების გამართვის პრივილეგია მისცა. საინტერესოა, რომ თეატრის დღევანდელი შენობა მესამეა ამ ადგილას. წინა ორი შენობა ხანძარმა ფაქტობრივად მიწასთან გაასწორა. დღევანდელი დიდებული ნაგებობა 1856 წელს გაიხსნა არქიტექტორ ალბერტ კავოსის პროექტით და მას შემდეგ მოსკოვის კულტურულ გულად ითვლება.

თეატრის ფასადზე აღმართულია აპოლონის ბრინჯაოს კვადრიგა (ოთხცხენიანი ეტლი), რაც ხელოვნების მწვერვალს განასახიერებს.
	<br><br>•	მთავარი დარბაზი გაფორმებულია ნამდვილი ოქროთი, წითელი ხავერდითა და უზარმაზარი ბროლის ჭაღით, რომლის დიამეტრი 6 მეტრია და 13 000-ზე მეტ ბროლის ელემენტს შეიცავს.
	<br><br>•	2005-2011 წლების მასშტაბური რეკონსტრუქციის დროს, რესტავრატორებმა ყველაფერი გააკეთეს მე-19 საუკუნის უნიკალური აკუსტიკის აღსადგენად. გამოიყენეს სპეციალური ხის მასალა (რეზონანსული ნაძვი), რათა ხმა დარბაზის ნებისმიერ კუთხეში იდეალურად ისმოდეს.
</span>
    <img src="images/rus.jpg">
    <span>
	•	„გედების ტბის“ სამშობლო: სწორედ ამ სცენაზე შედგა პიოტრ ჩაიკოვსკის გენიალური ბალეტის, „გედების ტბის“ პრემიერა 1877 წელს. დღესაც, ბოლშოის ბალეტი მსოფლიოში ყველაზე პრესტიჟულ და ტექნიკურად ძლიერ დასად ითვლება.
	<br><br>•	საოპერო ტრადიცია: თეატრი ცნობილია თავისი „დიდი სტილის“ ოპერებით. აქ იდგმება მოდესტ მუსორგსკის, ნიკოლაი რიმსკი-კორსაკოვისა და ჯუზეპე ვერდის მასშტაბური ნაწარმოებები.
	<br><br>•	მასშტაბები: თეატრში მუშაობს 3000-ზე მეტი ადამიანი — მომღერლები, მოცეკვავეები, ორკესტრის მუსიკოსები, მხატვრები და კოსტიუმების დიზაინერები.
<br><br>საინტერესო და ნაკლებად ცნობილი ფაქტები:
	<br><br>1.	ომისდროინდელი შენიღბვა: მეორე მსოფლიო ომის დროს, რათა გერმანულ ბომბდამშენებს თეატრი არ დაებომბათ, ის სპეციალური დეკორაციებით „შენიღბეს“ — ზემოდან ის ჩვეულებრივ საცხოვრებელ კორპუსებს ჰგავდა.
	<br><br>2.	ბანკნოტი: თუ ოდესმე ხელში 100-რუბლიანი კუპიურა ჩაგივარდებათ, იცოდეთ, რომ მასზე სწორედ დიდი თეატრის ფასადი და აპოლონის ეტლია გამოსახული.
	<br><br>3.	სკანდალები და ინტრიგები: თეატრი ცნობილია არა მხოლოდ ხელოვნებით, არამედ კულისებსმიღმა არსებული მკაცრი დისციპლინითა და კონკურენციით, რაც ხშირად ხდება დოკუმენტური ფილმების თემა.</span>
</div>`)

L.marker([40.83753337376817, 14.249648525315559]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/san_carlo.jpg">
    <span style="font-weight: bold;">სან-კარლოს თეატრი</span>
</div>`)

L.marker([47.502890820888666, 19.058318325641917]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/fa.jpg">
    <span style="font-weight: bold;">უნგრეთის სახელმწიფო ოპერის თეატრი</span>
    <span> უნგრეთის ოპერის თეატრი თავისი აკუსტიკის მიხედვით ევროპაში მესამე ადგილზეა. ამ მხრივ, მას მხოლოდ მილანის "ლა სკალა" და პარიზის ოპერის თეატრი უსწრებს. მისი პროექტის ავტორი უნგრელი არქიტექტორი მიკლოშ იბლია - სწორედ ის, ვინც ანდრაშის პროსპექტი დააპროექტა, ეგრეთ წოდებული "ბუდაპეშტის ელისეს მინდვრები".
    <br><br>
    უნგრეთის  ოპერის თეატრი ერთ-ერთი ულამაზესია მსოფლიოში. მასში 1261 ადამიანი ეტევა. დარბაზს ნალის ფორმა აქვს. იგი აშენებულია ნეორენესანსის სტილში და უხვადაა მორთული ბაროკოს სტილის ორნამენტებით, ქანდაკებებითა და ნახატებით. განსაკუთრებით საინტერესოა ბერტალან სეკეის, მორ ტანისა და კაროი ლოტცის მოხატული კედლები შიგა კიბის გასწვრივ და მაყურებელთა დარბაზში. მისი ჭაღი 3 ტონას იწონის.
    </span>
    <img src="images/HH.jpg">
    <span>
    ოპერის თეატრის მშენებლობა დაახლოებით 10 წელი გრძელდებოდა. მისი საზეიმო გახსნა 1884 წელს შედგა. ცერემონიას ავსტრია-უნგრეთის იმპერატორი ფრანც იოზეფი ესწრებოდა.
  <br><br>თეატრის პირველი დირექტორი იყო ფერენც ერკელი - პირველი უნგრული ოპერისა და ქვეყნის ეროვნული ჰიმნის ავტორი. მისი ქანდაკება შენობის შესასვლელთან გვხვდება. ეს პატივი წილად ხვდა კიდევ ერთ უნგრელ კომპოზიტორს, მსოფლიოში სახელგანთქმულ ფერენც ლისტს.
  <br><br>უნგრეთის ოპერის თეატრში მრავალი ცნობილი მომღერალი, დირიჟორი და კომპოზიტორი მუშაობდა, მათ შორის ჯაკომო პუჩინი.</span>
    </div>`)

L.marker([45.43371576528034, 12.333718619989982]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/la_fenice.jpg">
    <span style="font-weight: bold;">ლა ფენიჩე</span>
</div>`)

L.marker([48.139857604351675, 11.578796212181883]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/bavaria.jpg">
    <span style="font-weight: bold;">ბავარიის სახელმწიფო ოპერა</span>
</div>`)

L.marker([41.38032567538408, 2.1733806271891027]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/liceu.jpg">
    <span style="font-weight: bold;">ლიცეუს დიდი თეატრი</span>
</div>`)

L.marker([55.68227860131554, 12.60010392609836]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/Copenhagen.jpg">
    <span style="font-weight: bold;">კოპენჰაგენის ოპერის სახლი</span>
</div>`)

L.marker([59.907601442281724, 10.753170412862184]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/oslo.jpg">
    <span style="font-weight: bold;">ოსლოს ოპერის თეატრი - Operahauset</span>
    <span> ოპერის სახლი ოსლოს ცენტრში, ბიორვიკაში მდებარეობს, ოსლოფიორდთან ახლოს. ამშენებელია Statsbygg, სახელმწიფო მოღვაწე. არქიტექტორებად ნორვეგიული ფირმის Snøhetta-ს მუშაკები დაიქირავეს, მათვე ეკუთვნით ალექსანდრიაში, ეგვიპტე, „ალექსანდრიის ბიბლიოთეკის“ არქიტექტურაც.შენობა შექმნილია მარმარილოსა და მინისგან. იგი მკვეთრად გამოირჩევა გარშემო არსებული სხვა არქიტექტურისგან მისი თოვლივით თეთრი დახრილი სახურავის გამო. 
  ოპერის მშენებლობა 2007 წელს დასრულდა და 2008 წლის 12 აპრილს საზეიმოდ გაიხსნა. ოპერის სახლის სცენაზე გალა-კონცერტი ნორვეგიის მეფე ჰარალდ V-მ გახსნა. საზეიმო ცერემონიას გერმანიის კაცლერი ანგელა მერკელი და დანიის დედოფალი მარგრეტე II ესწრებოდნენ.
 <br><br> ოპერის თეატრმა 2008 წლის ოქტომბერში ბარსელონის არქიტექტურის ფესტივალზე კულტურული ჯილდო მიიღო. მისი უნიკალურობა იმაშიც არის,რომ დამთვალიერებლებს სახურავზე გასეირნებაც შეუძლიათ. შენობის ბაზის ზომა შეიძლება შევადაროთ ფეხბურთის მოედანს, მისი ფართობი 38 ათასი კვადრატული მეტრია. ძნელი წარმოსადგენია, მაგრამ ოპერаს აქვს 1100 ოთاხი და სამი სცენа.</span>
  <img src="images/oos.webp">
    </div>`)

L.marker([39.90652090435295, 116.39020854027748]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/beijing.jpg">
    <span style="font-weight: bold;">ხელოვნების ეროვნული ცენტრი</span>
    <span>ოპერის თეატრს რომელიც ჩინეთში, პეკინში მდებარეობს სასაუბრო ენაში ხშირად როგორც ,,მოხარშულ კვერცს" ისე მოიხსენიებენ, რისი მიზეზის შენობის ნახვისთანავე აშკარა ხდება. ,,მოხარშული კვერცხის" დამპროექტებელი ფრანგი არქიტექტორი პოლ ანდრეუა, რომელიც 2007 წელს გაიხსნა და აზიის უდიდეს თეატრალურ კომპლექსს წარმოადგენს. ნაგებობას აქვს ნახევრადსფერული ფორმა და არის სიმაღლით 46,285 მეტრი, ფართობით 119,900 კვადრატული მეტრი (მშენებლობის საერთო ფართობი დაახლოებით 165,000 კვადრატული მეტრია, მათ შორის 105,000 კვადრატული მეტრი ძირითადი შენობები და 60,000 კვადრატული მეტრი მიწისქვეშა, დამხმარე ნაგებობები). მისი საერთო ღირებულება 3,067 მილიარდი იუანია. ხელოვნების ცენტრში განთავსებულია ოპერის დარბაზი, მუსიკალური დარბაზი, თეატრისა და ხელოვნების საგამოფენო დარბაზები, რესტორნები, აუდიო მაღაზიები და სხვა დამხმარე ობიექტები.
 <br><br> ხელოვნების ეროვნული ცენტრის მშენებლობას წინ არაერთი წინააღმდეგობა შეხვდა. ქალაქ პეკინის დაგეგმარების თანახმად შენობის სიმაღლე არ უნდა ყოფილიყო 46მეტრზე მაღალი, თუმცა ოპერის თეატრის ფუნქციური მოთხოვნები არ ,,ჩარჩოში" ვერ ეტეოდა, ამიტომ მისი მიწისქვეშა სივრცის გამოყენება გადაწყდა. დღეს მისი საძირკვლის ყველაზე ღრმა ნაწილი 32.5 მეტრს აღწევს, რაც თითქმის 10 სართულიანი კორპუსის სიმაღლეა. კიდევ ერთი დაბრკოლება იყო ტერიტორიაზე არსებული მიწისქვეშა წყლები, რაც საფრთხეს შეუქმნიდა ნებისმიერი ნაგებობას თუ ამ გარემოებას არ გაითვალისწინებდნენ, თუმცა ეს პრობლემაც ძალიან ჭკვიანურად გადაჭრეს. იმ სიმაღლიდან საიდანაც მიწისქვეშა წყლები იწყებოდა 60მეტრ სიმაღლემდე ჩაასხეს რკინაბეტონის კედლები, რომლებმაც ,,ვედროს" მსგავსი კონსტრუქცია შექმეს, რომლიდანაც საჭიროების შემთხვევაში ხდება წყლის ამოტუმბვა, ამიტომ მასზე დადგმული შენობის საძირკველს საფრთხე არ ემუქრება.  
 </span>
    <img src="images/china.jpg">
    <span>
 ,,მოხარშული კვერცხს" გარშემო არტყავს ხელოვნური ტბა, თუმცა მაშინ როცა ზამთარში პეკინში ამინდი ნულ გრადუსზე ქვემოთ ჩამოდის (რაც საკმაოდ ხშირად ხდება), წყალი მაინც არ იყინება. ეს უკვე სწორედ იმ მიწისქვეშა წყლების დამსახურებაა, რადგან მიწისქვეშ წყალი მუდმივად ერთ ტემპერატურაშია, ზემოთ ამოტუმბვისას კი თერმოდინამიკის დახმარებით ცივ წყალს უფრო ათბობს.
 <br><br>თეატრის დიდი, ნახევრადსფერული გარსი ლითონის 18 000-ზე მეტი ფირფიტისგან შედგება და მინის 1200 მეტი ნაწილისგან. გუმბათის გარე ფენა დაფარულია ნანომასალებით, რაც უზრუნველყოფს იმას რომ წვიმისას ლაქები მისი ზედაპირზე არ რჩება.
</span>
    </div>`)

L.marker([37.77849066434197, -122.42031408452664]).addTo(map)
.bindPopup(`<div class="opera-popup"><img src="images/SFOperaHouse.jpg"><span style="font-weight: bold;">სან ფრანცისკოს ოპერის სახლი</span></div>`)

L.marker([40.418271130896834, -3.7102542881968907]).addTo(map)
.bindPopup(`<div class="opera-popup"><img src="images/madrid.png"><span style="font-weight: bold;">მადრიდის სამეფო თეატრი</span></div>`)

L.marker([-3.1301709557104815, -60.02344639089036]).addTo(map)
.bindPopup(`<div class="opera-popup"><img src="images/amazon.jpg"><span style="font-weight: bold;">ამაზონის თეატრი</span></div>`)

L.marker([49.94445624508625, 11.578242739265416]).addTo(map)
.bindPopup(`<div class="opera-popup"><img src="images/marg.jpg"><span style="font-weight: bold;">მარგრავიალის ოპერის თეატრი</span></div>`)

L.marker([42.27101535193348, 42.7026615983951]).addTo(map)
.bindPopup(`
    <div class="opera-popup">
        <img src="images/kutaisi.webp">
        <span style="font-weight: bold;">ქუთაისის ოპერის თეატრი</span>
        <span>
 თეატრალური წარმოდგენები ქალაქში 1861 წლიდან იმართებოდა, კირილე ლორთქიფანიძის, დიმიტრი ბაქრაძისა და აკაკი წერეთლის თაოსნობით. 1880 წელს კი კოტე მესხმა მუდმივი დასი ჩამოაყალიბა, რომელიც სტეფანე ხარაზიშვილის მიერ საგანგებოდ თეატრისათვის აგებულ შენობაში განთავსდა. ხარაზოვის თეატრი ხანძარმა იმსხვერპლა 1946 წელს. ახალი ოპერის თეატრი იმავე ადგილას აიგო და შენობის რუსთაველის ქუჩის მხარეზე მდებარე კედელი სწორედ ძველი თეატრისგან არის შემორჩენილი. 
 <br></br>1960 წლის 21 ნოემბერს თბილისში ჩატარდა საბჭოთა კავშირის 40 წლისთავისადმი მიძღვნილი მხატვრული თვითშემოქმედების კოლექტივთა IX საიუბილეო ოლიმპიადა, სადაც ქუთაისის სახალხო ოპერა მაყურებლის წინაშე წარსდგა ზ. ფალიაშვილის ოპერით „დაისი“. ამ ფაქტმა საფუძველი ჩაუყარა ქუთაისში ოპერის თეატრის დაარსებას. მაშინდელი კულტურის მინისტრის ოთარ თაქთაქიშვილის, თბილისის ოპერისა და ბალეტის თეატრის დირექტორის დიმიტრი მჭედლიძისა და სახალხო თეატრის სამხატვრო ხელმძღვანელის თეიმურაზ კობახიძის ძალისხმევით ჩამოყალიბდა და 1969 წლის 27 დეკემბერს საზეიმოდ გაიხსნა ზ. ფალიაშვილის სახელობის თბილისის ოპერისა და ბალეტის სახელმწიფო თეატრის ქუთაისის ფილიალი ზ. ფალიაშვილის ოპერით „აბესალომ და ეთერი“. სპექტაკლის დამდგმელი რეჟისორი გახლდათ გივი გაჩეჩილაძე, ქორმეისტერები ავთანდილ განუგრავა და ავთანდილ მაჭავარიანი, ბალეტმეისტერი - ანზორ მაჭარაძე, მხატვარი - ივანე ასკურავა; კონცერტმეისტერები რუსუდან კილაძე, მედეა კობახიძე, ლალი ჯავახაძე, მანიჟე ფირცხალაშვილი. სპექტაკლში მთავარ პარტიებს ასრულებდნენ - ზურაბ ანჯაფარიძე, მედეა და პეტრე ამირანაშვილები, იუზა ქუთათელაძე, ლიანა ღვედაშვილი, ნათელა ტუღუში, ოლია ჭურღულია, ვლადიმერ კანდელაკი, ანზორ გოგოლაშვილი, იოსებ ოცხელი. სპექტაკლს დირიჟორობდა თეატრის მთავარი დირიჟორი, საქართველოს ხელოვნების დამსახურებული მოღვაწე თეიმურაზ კობახიძე.
 1990 წლის 23 ივლისს თეატრი გახდა დამოუკიდებელი და მიენიჭა მ. ბალანჩივაძის სახელი. 
        </span>
        <img src="images/kuteisi.webp">
    </div>
`);

L.marker([30.084505331889112, 31.226105665906335]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/cairo.webp">
    <span style="font-weight: bold;">კაიროს ოპერის თეატრი</span>
    <span> კაიროს ოპერის თეატრი 1988 წლის 10 ოქტომბერს გაიხსნა. ამას წინ უძღვოდა ეგვიპტის პრეზიდენტ ჰოსნი მუბარაქის ვიზიტი 1983 წელს იაპონიაში, რის შემდეგაც გადაწყდა საოპერო თეატრის კომპლექსის დაფინანსება ეგვიპტელებისთვის, როგორც იაპონელი ერის საჩუქარი.
  <br><br> 1988 წლის ოქტომბერში, პრეზიდენტმა მუბარაქმა და მიკასას პრინცმა ტომოჰიტომ, იაპონიის იმპერატორის უმცროსმა ძმამ, გახსნეს ეროვნული კულტურის ცენტრის გენერალური ორგანო, სადაც ისტორიაში პირველად იაპონიამ აფრიკაში და არაბულ სამყაროში დადგა კაბუკის შოუ (ტრადიციული პოპულარული დრამა სიმღერითა და ცეკვით). 
  <br><br>კაიროს ოპერის თეატრის აღიარების ნიშნად, ლონდონის სამეფო ფილარმონიულმა ორკესტრმა ის აირჩია ახლო აღმოსავლეთსა და აფრიკაში თავისი პირველი წარმოდგენის ადგილად 2007 წლის იანვარში. 
 <br><br>არაბული უდის სახლი ამ შენობაში დაარსდა, სანამ ძველ ქალაქში მდებარე ნაგებობაში გადავიდოდნენ.</span>
 <img src="images/kai.jpg">
</div>`)

L.marker([51.054641282031426, 13.735319112339443]).addTo(map)
.bindPopup(`<div class="opera-popup">
    <img src="images/Semperoper.jpg">
    <span style="font-weight: bold;">დრეზდენის ოპერის თეატრი</span>
    <span> შენობა პირველად აიგო 1841 წელს არქიტექტორი გოტფრიდ ზემპერის პროექტით, ადრეული რენესანსის სტილში. ეს იყო გეგმაში მრგვალი ფორმის მქონე ნაგებობა, რომელიც იმჟამინდელი ევროპის ერთ-ერთ ყველაზე ლამაზ ოპერად ითვლებოდა.
<br><br>1869 წლის ხანძრის შედეგად შენობა ხელმეორედ იქნა ასაგები. მოქალაქეების მოთხოვნით რეკონსტრუქცია თავად გოტფრიდ ზემპერს უნდა განეხორციელებინა, მიუხედავად იმისა, რომ იმ პერიოდში არქიტექტორი დევნილი იყო 1849 წელს დრეზდენის აჯანყებაში მონაწილეობის გამო. მეორე ოპერის შენობა ზემპერის პროექტით, რომელიც საზღვარგარეთ ,,საზოგადობის თხოვნით" მისმა შვილმა ნეორენესანსის სტილში 1878 წელს ააგო. მშენებლობის პერიოდში წარმოდგენები იმართებოდა გევერბეჰაუსზალში (დრეზდენის ფილარმონია), რომელიც 1870 წელს გაიხსნა.
<br><br>ომამდელ პერიოდში შენობაში რიხარდ შტრაუსის მრავალი ნაწარმოების პრემიერა გაიმართა. მეორე მსოფლიო ომის ბოლო რამდენიმე კვირის პერიოდში დრეზდენის მოკავშირეთა მიერ დაბომბვისა და მის გამო გაჩენილ ხანძარში შენობა ისევ განადგურდა. ზუსტად 40 წლის შემდეგ, 1985 წლის 13 თებერვალს, ოპერის შენობის რეკონსტრუქცია დასრულდა მის ომამდელ მდგომარეობაში. ახლა მას ზემპერის მესამე ოპერასაც უწოდებენ. პირველი საოპერო სეზონი გაიხსნა 1945 წელს დანგრევამდე შესრულებული ბოლო ოპერით: ვებერის ”ფრაიშუტცი”.
 <br><br>შენობა დრეზდენის ბაროკოს არქიტექტურის საუკეთესო ნიმუშად ითვლება; მდებარეობს თეატრის მოედანზე ცენტრალურ დრეზდენში მდ. ელბას სანაპიროზე. პორტალის თავზე პანტერებშებმული ქარიოტი დგას დიონისეს ქანდაკებით. შენობის ინტერიერზე იმ დროის განთქმული არქიტექტორი იოჰანეს შილინგი მუშაობდა. პორტალის მონუმენტებზე გამოსახულია უდიდესი ხელოვანები იოჰან ვოლფგანგ ფონ გოეთე, ფრიდრიხ შილერი, უილიამ შექსპირი, სოფოკლე, მოლიერი და ევრიპიდე.შენობის წინ დგას ცხენზე ამხედრებული მეფე იოჰან საქსონიელის ქანდაკება. ინტერიერს ამშვენებს მოხატულობა ოქროს გამოყენებით და სხვადასხვა ფერის მარმარილო.12 მეტრი სიგრძისა და 7 მეტრი სიმაღლის ფარდა 400 კილოგრამს იწონის. ის ზუსტად აღადგინეს ისტორიული ესკიზების მიხედვით. მასზე გამოსახულია პოეტებისა და ფილოსოფოსების ბიუსტები, ლირიკული კომპოზიციები და გირლანდები.
  <br><br>2016 წელს გაიხსნა თეატრის მეორე, ექსპერიმენტული სცენა - ზემპერ ცვაი (Semper Zwei), რომელიც ძირითადი შენობის უკან მდებარეობს.</span>
   <img src="images/dre.jpg"> <img src="images/zden.jpg">
    </div>`)

L.marker([41.70100428001451, 44.79601098487503]).addTo(map)
    .bindPopup(`<div class="opera-popup">
        <img src="images/National_Opera_House._Tbilisi,_Georgia.jpg">
        <span style="font-weight: bold;">თბილისის ოპერისა და ბალეტის თეატრი</span> 
        <span>თეატრი დაარსდა 1851 წელს და მისი ისტორია უკავშირდება XIX საუკუნის თბილისს, როდესაც ქალაქი კულტურული განვითარების მნიშვნელოვან ეტაპზე იმყოფებოდა. თავდაპირველი შენობა რამდენჯერმე დაზიანდა და განახლდა, ხოლო თანამედროვე ნაგებობა აშენებულია გერმანელი არქიტექტორის, ვიქტორ შრეტერი-ის პროექტით. 
        <br><br>შენობა გამოირჩევა უნიკალური ფსევდო-მავრიტანული სტილით, რომელიც აერთიანებს აღმოსავლურ და ევროპულ არქიტექტურულ ელემენტებს. თეატრის ისტორია საკმაოდ დრამატულია — მისი შენობა ორჯერ დაიწვა. პირველი ხანძარი მოხდა 1874 წელს, რის შემდეგაც თეატრი სრულად აღადგინეს. მოგვიანებით, 1973 წელსაც დაზიანდა ხანძრის შედეგად, თუმცა კვლავ აღდგა და ფუნქციონირება განაგრძო. 
       <br><br> თეატრის დარბაზი დაახლოებით 1200 მაყურებელს იტევს და გამოირჩევა განსაკუთრებული აკუსტიკით, რაც ოპერის შესრულებისთვის ძალიან მნიშვნელოვანია. სწორედ ამიტომ აქ გამართული კონცერტები მაღალი ხარისხით გამოირჩევა .  საბჭოთა პერიოდში თეატრი იყო ერთ-ერთი მთავარი კულტურული ცენტრი კავკასიაში და ხშირად მასპინძლობდა საერთაშორისო ფესტივალებსა და ტურნეებს. შენობის ინტერიერი განსაკუთრებული ფუფუნებით გამოირჩევა — გამოყენებულია ოქროსფერი ორნამენტები, მოჩუქურთმებული აივნები და კლასიკური სტილის დეკორაციები, რაც ევროპული ოპერის თეატრების ტრადიციას მიჰყვება. 
         </span>
    <img src="images/tb.jpg">
    <span>
        თეატრში იმართება ოპერისა და ბალეტის წარმოდგენები, სიმფონიური კონცერტები და სხვადასხვა კულტურული ღონისძიებები. მის რეპერტუარში შედის როგორც მსოფლიო კლასიკის ნიმუშები, ასევე ქართული ოპერები და ბალეტები, მაგალითად „აბესალომ და ეთერი“. თეატრი დიდ როლს ასრულებს ქართული მუსიკალური ხელოვნების განვითარებაში და საერთაშორისო დონეზეც ცნობილია. 
 </span>
    <img src="images/tbii.jpg">
    <span>
თეატრი ხშირად იყო შეხვედრის ადგილი ქალაქის ინტელიგენციისთვის — აქ იკრიბებოდნენ მწერლები, მუსიკოსები და საზოგადო მოღვაწეები, რომლებიც არა მხოლოდ სპექტაკლებს ესწრებოდნენ, არამედ კულტურულ და პოლიტიკურ საკითხებსაც განიხილავდნენ.  ერთ-ერთი ყველაზე გავრცელებული და საინტერესო ისტორია უკავშირდება თეატრის პირველ დიდ ხანძარს 1874 წელს. იმ საღამოს თეატრში წარმოდგენა მიმდინარეობდა და დარბაზი მაყურებლით იყო სავსე. მოულოდნელად შენობაში ხანძარი გაჩნდა, რომელიც ძალიან სწრაფად გავრცელდა, რადგან ინტერიერში გამოყენებული იყო ხის დეკორაციები და ქსოვილები. ამბობენ, რომ იმ დროს სცენაზე მომღერლებმა და მსახიობებმა წარმოდგენა არ შეწყვიტეს და სცადეს პანიკის თავიდან აცილება, რათა მაყურებლებს მშვიდად დაეტოვებინათ დარბაზი. საბოლოოდ, ადამიანების უმეტესობა უვნებლად გადარჩა, თუმცა შენობა თითქმის მთლიანად განადგურდა. ამ შემთხვევამ დიდი გავლენა მოახდინა თბილისის კულტურულ ცხოვრებაზე. რამდენიმე წლის განმავლობაში ქალაქი ოპერის გარეშე დარჩა, მაგრამ თეატრის მნიშვნელობიდან გამომდინარე, იგი მალევე აღადგინეს და უფრო დახვეწილი და გამძლე ფორმით ააშენეს. 
<br><br>დღეს თბილისის ოპერისა და ბალეტის თეატრი არა მხოლოდ ისტორიული მემკვიდრეობის ნაწილია, არამედ აქტიურად მოქმედი კულტურული სივრცე, სადაც თანამედროვე და კლასიკური ხელოვნება ერთიანდება.</span> 
        </div>`)


    map.whenReady(function() {
    setTimeout(function() {
        map.invalidateSize();
    }, 100);
});

map.on('popupopen', function(e) {
    setTimeout(function() {
        e.popup.update();
    }, 10);
});
